#include <stdio.h>
//// 例一：
//// 简述大段字节和小段字节的概念，设计一个小程序来判断当前机器的字节序
//
//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//	//char* p = (char*)&a;
//	//// *p ==1,返回1，小端
//	//// *p ==0,返回0，大端
//	//return *p;
//	/*char* p = (char*)&a;
//	if (*p == 1)
//		return 1;
//	else
//		return 0;*/
//	
//}
//int main()
//{
//	/*int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小端字节");
//	}
//	else
//	{
//		printf("大端字节");
//	}*/
//	int ret = check_sys();
//	if (ret == 1)
//		printf("小端");
//	else
//		printf("大端");
//	return 0;
//}
//
//int main()
//{
//	int a = 0x11223344;
//	//int* p = &a;
//	//*p = 0;      // 4个字节变成00 00 00 00
//	char* p = &a;
//	*p = 0;
//	return 0;
//}

//  题一：
//int main()
//{
//	char a = -1;
//	//原码 10000000000000000000000000000001
//	//反码 11111111111111111111111111111110
//	//补码 11111111111111111111111111111111
//	// 11111111
//	// 补码：11111111111111111111111111111111   返回去，打印原码   -1
//	signed char b = -1;
//	//同上
//	// 11111111
//	// 11111111111111111111111111111111     同上        -1
//	unsigned char c = -1;
//	// 11111111
//	// 00000000000000000000000011111111      无符号数，第一位为0，结果255
//	printf("a=%d b=%d c=%d", a, b, c);
//	// char 变成 int 要进行整型提升（符号位为1，补码末位8位前全加1；符号位为0，全加0）
//	return 0;
//}

//  题二：

int main()
{
	char a = -128;
	char b = 128;    // char中放不下，128 = 127+1
	// 10000000000000000000000010000000    原码
	// 11111111111111111111111101111111    反码
	// 11111111111111111111111110000000    补码
	// 内存里存补码的最后8位
	// 10000000
	// 整型提升
	// 11111111111111111111111110000000     补码
	// 打印一个无符号数：即其补码就是原码
	// 11111111111111111111111110000000     原码
	printf("%u\n%u\n", a,b);
	// %d - 打印十进制的有符号数字
	// %u - 打印十进制的无符号数字
	return 0;
}

// 有符号的char的范围是 -128 -> 127     10000000直接看作 -128
// 无符号的char的范围是 0 -> 255        （补码即原码，无负数） 